CSI API ETABS v1
cLineElm.GetObj Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetObj(
	string Name,
	ref string Obj,
	ref int ObjType,
	ref double RDI,
	ref double RDJ
)
Function GetObj (
	Name As String,
	ByRef Obj As String,
	ByRef ObjType As Integer,
	ByRef RDI As Double,
	ByRef RDJ As Double
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Obj As String
Dim ObjType As Integer
Dim RDI As Double
Dim RDJ As Double
Dim returnValue As Integer
returnValue = instance.GetObj(Name, Obj,
	ObjType, RDI, RDJ)
int GetObj(
	String^ Name,
	String^% Obj,
	int% ObjType,
	double% RDI,
	double% RDJ
)
abstract GetObj :
        Name : string *
        Obj : string byref *
        ObjType : int byref *
        RDI : float byref *
        RDJ : float byref -> int
Parameters
Name
Type: System.String
Obj
Type: System.String
ObjType
Type: System.Int32
RDI
Type: System.Double
RDJ
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace